# Задача 30: Заполните массив элементами арифметической прогрессии.
# Её первый элемент, разность и количество элементов нужно ввести с клавиатуры.
# Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.

a1 = int(input("Input a1: "))
d = int(input("Input d: "))
n = int(input("Input n: "))

arrayArifm = []

for i in range(n):
    c = a1 + i * d
    arrayArifm.append(c)
     
print(arrayArifm)


# Задача 32: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону 
# (т.е. не меньше заданного минимума и не больше заданного максимума)


